
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Conceitos básicos · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.2">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="fisica.html" />
    
    
    <link rel="prev" href="introducao.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="disclaimer.html">
            
                <a href="disclaimer.html">
            
                    
                    Esclarecimento
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="syllabus.html">
            
                <a href="syllabus.html">
            
                    
                    Plano de ensino
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="introducao.html">
            
                <a href="introducao.html">
            
                    
                    Introdução
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="conceitos.html">
            
                <a href="conceitos.html">
            
                    
                    Conceitos básicos
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="fisica.html">
            
                <a href="fisica.html">
            
                    
                    Camada física
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="enlace.html">
            
                <a href="enlace.html">
            
                    
                    Camada de enlace
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="rede.html">
            
                <a href="rede.html">
            
                    
                    Camada de rede
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="transporte.html">
            
                <a href="transporte.html">
            
                    
                    Camada de transporte
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="aplicacao.html">
            
                <a href="aplicacao.html">
            
                    
                    Camada de aplicação
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="seguranca.html">
            
                <a href="seguranca.html">
            
                    
                    Segurança
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >Conceitos básicos</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="conceitos-b&#xE1;sicos">Conceitos b&#xE1;sicos</h1>
<blockquote>
<p>&#x201C;We live in a very complex world.&#x201D;
&#x2013; Vint Cerf.</p>
</blockquote>
<p>Neste cap&#xED;tulo, introduziremos alguns conceitos e nomenclaturas utilizados em redes de computadores. Tamb&#xE9;m discutiremos brevemente o modelo OSI e TCP/IP, que s&#xE3;o os modelos mais conhecidos e discutiremos a abordagem adotada nesta apostila, que mescla um pouco dos dois modelos.</p>
<p>J&#xE1; vimos que uma rede de computadores &#xE9; formada por dois ou mais dispositivos interconectados atrav&#xE9;s de uma tecnologia e conseguem trocar/compartilhar informa&#xE7;&#xF5;es e/ou recursos. Isto &#xE9; importante, pois &#xE9; a defini&#xE7;&#xE3;o de uma rede de computadores! Atrav&#xE9;s da uni&#xE3;o de muitas e muitas redes, n&#xF3;s constru&#xED;mos o que chamamos de Internet - a rede mundial de computadores. Em redes de computadores, chamamos os dispositivos interconectados de <strong>n&#xF3;s</strong> (em ingl&#xEA;s, <em>nodes</em>).</p>
<p>Aqui vale apresentar a distin&#xE7;&#xE3;o entre <strong>internet</strong> e <strong>Internet</strong>. <strong>Internet</strong> &#xE9; a entidade que representa essa interconex&#xE3;o mundial de diversas redes de computadores, j&#xE1; <strong>internet</strong> &#xE9; simplesmente a interconex&#xE3;o de computadores. Basicamente a escala da rede &#xE9; o grande diferencial. Quando estamos nos referindo a esta entidade, onde simplesmente podemos digitar alguma coisa em um navegador e ele retornar o resultado que possivelmente esta em outro continente, e para chegar at&#xE9; a minha m&#xE1;quina, passou por diversas redes em diferentes pa&#xED;ses, esta &#xE9; a Internet. Agora, eu abri um arquivo do meu computador e mandei imprimir na minha impressora <em>wireless</em>, esta &#xE9; a internet.</p>
<p>Com advento das redes de computadores foi poss&#xED;vel introduzir diversas aplica&#xE7;&#xF5;es: compartilhamento de recursos (peer-to-peer), e-mail, mensagens instant&#xE2;neas (mIRC, icq, messenger,...), Voice over IP (VOIP), e-commerce, redes sociais (myspace, orkut, facebook, instagram, ...), IPTV e muitas outras. O uso de redes de computadores tem hoje aplica&#xE7;&#xF5;es comerciais e dom&#xE9;sticas; que muitas vezes se intersectam. Do lado das aplica&#xE7;&#xF5;es comerciais, existem neg&#xF3;cios contru&#xED;dos tendo a Internet como base. Isto implica o neg&#xF3;cio em diversas formas, positiva e negativamente. Do lado positivo temos a facilidade, o alcance que o seu neg&#xF3;cio pode ter, sem barreiras f&#xED;sicas. O lado negativo &#xE9; que se as interconex&#xF5;es falham, as perdas tamb&#xE9;m podem ser grandes.</p>
<p>Atualmente existe uma categoriza&#xE7;&#xE3;o para o tamanho das redes baseado na dist&#xE2;ncia entre os n&#xF3;s:</p>
<p><img src="imgs/cap-conceitos/conceitos-01.png" alt=""></p>
<p><strong>Rede de &#xC1;rea Pessoal (<em>Personal Area Network</em> - PAN)</strong> : s&#xE3;o redes pessoais, ou seja, &#xE9; a conex&#xE3;o entre dispostivos que est&#xE3;o em uma dist&#xE2;ncia muito pequena, um ou dois metros. Se for uma rede PAN sem fio, temos uma <strong>WPAN (<em>Wireless</em> PAN)</strong>. Encontramos nesta categoria os dispositivos com a tecnologia <a href="https://www.bluetooth.com/" target="_blank">bluetooth</a>, infravermelho, e outros. &#xC9; por exemplo, o mouse sem fio conectado no computador, ou quando conectamos nosso celular ao celular de outra pessoa usando bluetooth para compartilhar um arquivo ou mesmo acesso ao 3/4G.</p>
<p><strong>Rede de &#xC1;rea Local (<em>Local Area Network</em> - LAN)</strong> : esta entre 10m e 1km, ou seja, ela pode estar dentro de um c&#xF4;modo ou uma casa, um escrit&#xF3;rio, uma empresa ou um campus universit&#xE1;rio. Esta &#xE9; mais f&#xE1;cil de entendermos, pois utilizamos no nosso dia-a-dia. Na sua casa, possivelmente voc&#xEA; tem um roteador wi-fi criando uma pequena LAN. No seu est&#xE1;gio ou trabalho, quando voc&#xEA; chega, tamb&#xE9;m deve ter uma LAN interconectando as m&#xE1;quinas. E na pr&#xF3;pria universidade, que tem uma extens&#xE3;o maior, tamb&#xE9;m &#xE9; considerada uma LAN. Tamb&#xE9;m temos uma nomenclatura especial, quando ela utiliza a tecnologia <em>wireless</em>, <strong>WLAN (<em>Wireless</em> LAN)</strong>. Encontramos habitualmente os cabos par tran&#xE7;ados e a tecnologia wi-fi.</p>
<p><strong>Rede Metropolitana (<em>Metropolitan Area Network</em> - MAN)</strong> : a cobertura de uma rede de &#xE1;rea metropolitana, como o nome diz, &#xE9; uma cidade. Em uma MAN, temos a interconex&#xE3;o de diversas LANs atrav&#xE9;s de uma <strong>&quot;espinha dorsal&quot;</strong> ou <strong><em>backbone</em></strong>. Geralmente, a velocidade dos <em>backbones</em> &#xE9; muito alta.</p>
<p><strong>Rede Geogr&#xE1;ficamente Distribu&#xED;das(<em>Wide Area Network</em> - WAN)</strong> : a rede de maior &#xE1;rea que interliga LANs e MANs, ultrapassando limites geogr&#xE1;ficos, abrangendo um pa&#xED;s ou continente.</p>
<p>Ainda, recentemente, devido ao avan&#xE7;o tecnol&#xF3;gico, alguns novos grupos s&#xE3;o encontrados na literatura tamb&#xE9;m. Devido aos dispositivos <em>e-healthy</em>, smartphones <em>wearables gadgets</em> e <em>smartwatches</em>, temos as <em>Body Area Network</em> ou <em>Body Sensor Network</em>. Quando utiliza tecnologia wireless, temos as <strong>WBAN (<em>Wireless</em> BAN)</strong>. Trata-se de uma rede pessoal reduzida aos dispositivos que se encontram no nosso corpo.</p>
<p>E por fim, devido aos avan&#xE7;os dos eletr&#xF4;nicos das casas como smartTVs, geladeiras, <em>home centers</em> e outros, encontramos o termo <strong><em>Home Area Network</em> (HAN)</strong>. Trata-se de uma rede local dom&#xE9;stica, mas devido ao crescente n&#xFA;mero de dispositivos ligados a rede e a pr&#xF3;pria Internet.</p>
<p>Al&#xE9;m da classifica&#xE7;&#xE3;o atrav&#xE9;s da &#xE1;rea, podemos classificar as redes de acordo com a maneira ocmo transmitem a informa&#xE7;&#xE3;o. Existem dois tipos de tecnologias de transmiss&#xE3;o de dados predominante:</p>
<ul>
<li><p><strong>Redes de difus&#xE3;o (<em>broadcast/multicast</em>)</strong> : Neste caso, o meio &#xE9; compartilhado entre todos os pontos da rede, desta forma, assim que uma mensagem &#xE9; enviada, todos recebem. Existe um campo no cabe&#xE7;alho, informando para quem &#xE9; a mensagem, e somente esta pessoa consegue acessar a informa&#xE7;&#xE3;o, as outras simplesmente ignoram a informa&#xE7;&#xE3;o. Tamb&#xE9;m temos a possibilidade de enviar para todos, atrav&#xE9;s de uma informa&#xE7;&#xE3;o especial no cabe&#xE7;alho. O termo <strong><em>Broadcast</em></strong> &#xE9; quando a trasmiss&#xE3;o &#xE9; para todos, por exemplo, rede de televis&#xE3;o de canal aberto ou r&#xE1;dio. Agora o termo <strong><em>Multicast</em></strong> &#xE9; seletivo, ele envia para um grupo da rede, portanto, nem todos receber&#xE3;o, apenas alguns.</p>
</li>
<li><p><strong>Redes ponto a ponto (<em>unicast</em>)</strong> : Nas redes ponto a ponto, como o pr&#xF3;prio nome diz, &#xE9; uma conex&#xE3;o entre pares individuais. Para ir de uma origem a um destino, neste tipo de rede &#xE9; necess&#xE1;rio passar por diversos pares de conex&#xE3;o.</p>
</li>
</ul>
<h2 id="modelo-em-camadas">Modelo em camadas</h2>
<p>Para reduzir a complexidade do projeto de uma rede, na maiora dos casos, ela &#xE9; organizada como uma pilha. Assim, cada n&#xED;vel da pilha tem uma fun&#xE7;&#xE3;o ou mais fun&#xE7;&#xF5;es bem definidas, e conversa com a camada acima atrav&#xE9;s de uma interface para prover seus servi&#xE7;os para as camadas superiores. Cada camada define um ou mais protocolos para que a comunica&#xE7;&#xE3;o possa funcionar. A figura abaixo, ilustra essa ideia.</p>
<p><img src="imgs/cap-conceitos/conceitos-02.png" alt=""></p>
<p>O conjunto de camadas e protocolos &#xE9; uma <strong>arquitetura</strong>. Comumente, uma arquitetura &#xE9; definida por um conjunto de empresas e universidades, pois s&#xE3;o padronizados e definidos os hardwares e softwares. A <strong>pilha de protocolos</strong> nada mais s&#xE3;o que os protocolos de cada camada adotado pela arquitetura.</p>
<p>Em um projeto de uma arquitetura de redes, existem quest&#xF5;es importantes para tratar, como a forma de endere&#xE7;amento para que uma mensagem saia de um ponto de origem e chegue a um ponto de destino. Antes disto, como os sinais ser&#xE3;o codificados para enviar bits de um lado para outro. O controle de erros &#xE9; outra quest&#xE3;o essencial, pois sabemos que pode haver interfer&#xEA;ncias no canal de comunica&#xE7;&#xE3;o. Al&#xE9;m disso, quem pode enviar o qu&#xEA; e em qual momento, ou seja, o tratamento do controle de fluxo. Estas e outras quest&#xF5;es est&#xE3;o relacionadas aos projetos de uma arquitetura de redes. E tudo isto, no final, &#xE9; transparente ao usu&#xE1;rio final.</p>
<p>Resumindo, o modelo em camadas &#xE9; importante pois permite a visualiza&#xE7;&#xE3;o das fun&#xE7;&#xF5;es de rede que acontecem em cada camada, decompondo as comunica&#xE7;&#xF5;es de rede em partes menores e mais simples. Assim, padroniza os componentes de rede, permitindo o desenvolvimento e o suporte por parte de v&#xE1;rios fabricantes.</p>
<h2 id="osi-x-tcpip">OSI x TCP/IP</h2>
<p>Existe um modelo de refer&#xEA;ncia proposto pela ISO - <em>International Organization for Standardization</em>, chamado de <strong><em>Open System Interconnection</em> (OSI)</strong>. Este modelo possui sete camadas que definem como os sistemas abertos poder ser interconectados pela rede. Sendo um modelo de refer&#xEA;ncia, ele &#xE9; uma especifica&#xE7;&#xE3;o que <strong>orienta</strong> como implementar, e n&#xE3;o <strong>implementa</strong>.</p>
<p><img src="imgs/cap-conceitos/conceitos-03.png" alt=""></p>
<p>Uma padroniza&#xE7;&#xE3;o &#xE9; ben&#xE9;fica, pois reduz o custo, devido &#xE0; padroniza&#xE7;&#xE3;o de produtos e ainda permite independ&#xEA;ncia no desenvolvimento de software e hardware. Agiliza a ado&#xE7;&#xE3;o de novas tecnologias, facilita a detec&#xE7;&#xE3;o e corre&#xE7;&#xE3;o de problemas na rede e
&#xE9; utilizado como refer&#xEA;ncia para as diversas arquiteturas de rede.</p>
<p>Como observamos na figura acima, o <strong>modelo OSI</strong> &#xE9; formada pelas seguintes camadas:</p>
<p><strong>F&#xED;sica</strong> :  S&#xE3;o as conex&#xF5;es el&#xE9;tricas formadas pelos modems, linhas f&#xED;sicas, conectores, cabos e interfaces de hardware de comunica&#xE7;&#xE3;o dos equipamentos. Nesse n&#xED;vel temos:</p>
<ul>
<li>As defini&#xE7;&#xF5;es dos sinais el&#xE9;tricos;</li>
<li>Transmiss&#xE3;o de bits;</li>
<li><p>Interface mec&#xE2;nicas, el&#xE9;tricas e de sincroniza&#xE7;&#xE3;o.</p>
<p><strong>Enlace</strong> : Nesta camada, a principal fun&#xE7;&#xE3;o &#xE9; permitir uma comunica&#xE7;&#xE3;o entre n&#xF3;s adjacentes, transformando um canal de transmiss&#xE3;o normal em uma linha que pare&#xE7;a livre de erros de transmiss&#xE3;o; controlar o fluxo de quadros; controlar o acesso ao meio, onde as redes de broadcast devem controlar o acesso ao canal compartilhado.</p>
</li>
</ul>
<p><strong>Rede</strong> : Uma vez que a comunica&#xE7;&#xE3;o entre n&#xF3;s adjacentes seja poss&#xED;vel, esta camada se preocupa com a transmiss&#xE3;o entre um emissor e receptor, e os n&#xF3;s intermedi&#xE1;rios. &#xC9; realizado o controle de todo o trafego dentro da rede externa, como o roteamento dos dados entre os n&#xF3;s da rede para atingir o endere&#xE7;o final. Os pacotes de dados s&#xE3;o encaminhados entre os n&#xF3;s da rede at&#xE9; atingirem o seu destino. A qualidade do servi&#xE7;o (QoS) como atraso, tempo em tr&#xE2;nsito, instabilidades, falha e outros &#xE9; tratadi aqui. Permitir que redes heterog&#xEA;neas sejam interconectadas.</p>
<p><strong>Transporte</strong> : Sua fun&#xE7;&#xE3;o &#xE9; aceitar dados da camada acima dela, dividi-los em unidades menores (se necess&#xE1;rio) e repassar para a camada de redes, garantindo que todos os fragmentos chegar&#xE3;o corretamente &#xE0; outra extremidade. Aqui temos uma verdadeira camada fim-a-fim, que liga a origem ao destino. Al&#xE9;m disto, esta camada determina que tipo de servi&#xE7;o &#xE9; fornecido &#xE0; camada de sess&#xE3;o.</p>
<p><strong>Sess&#xE3;o</strong> : Esta camada permite que se estabele&#xE7;am sess&#xF5;es de comunica&#xE7;&#xF5;es em diferentes m&#xE1;quinas, controlando quem deve transmitir e em qual momento fazendo assim o gerenciamento de tokens e controle de di&#xE1;logo e sincroniza&#xE7;&#xE3;o.</p>
<p><strong>Apresenta&#xE7;&#xE3;o</strong> : Esta camada esta preocupada com as estruturadas de dados e outras maneiras de abstra&#xE7;&#xE3;o que podem ser definidas para a troca de estruturas de dados de n&#xED;veis mais altos.</p>
<p><strong>Aplica&#xE7;&#xE3;o</strong> : Cont&#xE9;m uma s&#xE9;rie de protocolos e padr&#xF5;es que s&#xE3;o utilizados pela aplica&#xE7;&#xE3;o final. Por exemplo, o protocolo mais famoso &#xE9; HTTP (HyperText Transfer Protocol), que &#xE9; utilizado pelos navegadores para apresentar conte&#xFA;dos ao usu&#xE1;rio.</p>
<p>O outro modelo que temos &#xE9; o modelo TCP/IP, mas antes, abaixo uma ilustra&#xE7;&#xE3;o utilizando as sete pilhas do OSI, mas apresentando as camadas do TCP/IP.</p>
<p><img src="imgs/cap-conceitos/conceitos-04.png" alt=""></p>
<p>O <strong>modelo TCP/IP</strong>, como o pr&#xF3;prio nome carrega, &#xE9; fundamentado em dois protocolos: <strong><em>Transport Control Procotol</em> - TCP</strong> e <strong><em>Internet Protocol</em> - IP</strong>. Robert Kahn e Vint Cerf desenvolveram e publicaram <a href="http://www.cs.princeton.edu/courses/archive/fall06/cos561/papers/cerf74.pdf" target="_blank">A Protocol for Packet Network Intercommunication</a>, al&#xE9;m disto, Robert Kahn em outubro de 1972 na <em>International Computer Communication Conference</em>, apresentou pela 1a vez uma demonstra&#xE7;&#xE3;o do ARPANET conectando 40 computadores.</p>
<p>A ARPANET, tida como &quot;av&#xF3;&quot; da Internet e de todas as redes de computadores geograficamente distribuidas era uma rede patrocinada pelo DARPA/ARPA (<em>Defense / Advanced Research Project Agency</em>). No inicio participavam universidades e departamentos do governo americano. O departamento de defesa tinha a grande preocupa&#xE7;&#xE3;o que com a destrui&#xE7;&#xE3;o de um dos host intermedi&#xE1;rios, a rede perdesse conex&#xE3;o. Ou seja, a rede deveria manter-se funcionando desde que a origem e o destino estivessem funcionando, mesmo que algumas m&#xE1;quinas intermedi&#xE1;rias tivessem problemas. Outro requisito era de uma rede flex&#xED;vel, sendo capaz de transmitir arquivos e dados de voz em tempo real. &#xC9; poss&#xED;vel encontrar mais informa&#xE7;&#xF5;es sobre o nascimento da Internet <a href="http://www.livinginternet.com" target="_blank">aqui</a>.</p>
<p>As camadas do modelo TCP/IP s&#xE3;o:</p>
<p><strong>Host/rede</strong> : N&#xE3;o existe muitas informa&#xE7;&#xF5;es sobre os protocolos deste n&#xED;vel, apenas que os hosts precisam se conectar a rede de alguma forma para enviar pacotes IP.</p>
<p><strong>Inter-redes</strong> : Semelhante a camada de redes do modelo OSI, esta camada &#xE9; respons&#xE1;vel por endere&#xE7;ar os <em>hosts</em> da rede e garantir que os pacotes saiam de uma origem e cheguem ao destino, mesmo passando por redes diferentes. Seu protocolo fundamentel &#xE9; o <em>Internet Protocol</em> (IP) que possibilida o endere&#xE7;amento, o roteamento e demais</p>
<p><strong>Transporte</strong> : Assim como a camada de transporte do modelo OSI, o importante aqui &#xE9; estabelecer uma comunica&#xE7;&#xE3;o fim a fim. No modelo TCP/IP foram definidos dois protocolos que cumprem esse papel: TCP e UDP. Trataremos das diferen&#xE7;as deles, quando discutirmos a camada de transporte.</p>
<p><strong>Aplica&#xE7;&#xE3;o</strong> : N&#xE3;o viu-se a necessidade das camadas de sess&#xE3;o e apresenta&#xE7;&#xE3;o, pois do ponto de vista pr&#xE1;tico, eram pouco utilizadas. Nesta camada, encontram-se os protocolos de n&#xED;vel mais alto. FTP, Telnet, SSH, SMTP, HTTP, e muitos outros que veremos mais adiante.</p>
<p>Em cada camada, tanto no modelo OSI quanto no modelo TCP/IP, eles trabalham com <strong><em>Protocol Data Unit (PDU)</em></strong> ou Unidade de Dado do Protocolo. A figura abaixo ilustra os protocolos, bem como o pacotes s&#xE3;o encapsulados em cada camada.</p>
<p><a href="imgs/cap-conceitos/conceitos-05.png"></a></p>
<p>Nesta apostila, e no curso, n&#xF3;s abordaremos as seguintes camadas: F&#xED;sica, Enlace de Dados, Rede, Transporte e Aplica&#xE7;&#xE3;o.</p>
<h2 id="mas-quem-padroniza-essa-bagun&#xE7;a">Mas quem padroniza essa bagun&#xE7;a?</h2>
<p>Como redes de computadores tem a intersec&#xE7;&#xE3;o entre telecomunica&#xE7;&#xF5;es e computa&#xE7;&#xE3;o, temos alguns org&#xE3;os que padronizam tanto a parte de hardware como a parte de protocolos necess&#xE1;rios para os softwares conversarem.</p>
<p>Da parte de engenharia de telecomunica&#xE7;&#xF5;es, a <a href="http://www.itu.int" target="_blank"><strong><em>International Telecommunication Union</em> (ITU)</strong></a> &#xE9; quem tem a miss&#xE3;o de padronizar as telecomunica&#xE7;&#xF5;es internacionais. Eles padronizam as comunica&#xE7;&#xF5;es desde os tempos dos tel&#xE9;grafos, padronizando o c&#xF3;digo morse. Ap&#xF3;s a 2a Grande Guerra, o ITU tornou-se um &#xF3;rg&#xE3;o das Na&#xE7;&#xF5;es Unidas. <a href="http://www.itu.int/newsroom/press_releases/1998/04.html" target="_blank">A padroniza&#xE7;&#xE3;o de modems de 56 kbps V.90 &#xE9; uma recomenda&#xE7;&#xE3;o do ITU.</a></p>
<p>Outro org&#xE3;o que esta sempre presente quando falamos de padroniza&#xE7;&#xE3;o &#xE9; o <a href="https://www.iso.org/" target="_blank"><strong><em>International Standard Organization</em> (ISO)</strong></a>. &#xC9; uma organiza&#xE7;&#xE3;o volunt&#xE1;ria independente, e seus membros s&#xE3;o as organiza&#xE7;&#xF5;es nacionais de padr&#xF5;es. A representante do Brasil &#xE9; a <a href="https://wwww.abnt.org.br" target="_blank">Associa&#xE7;&#xE3;o Brasileira de Normas T&#xE9;cnicas (ABNT)</a>. A ISO faz parte do ITU-T, grupo do ITU relacionado a discuss&#xE3;o de tecnologias, para evitar padr&#xF5;es oficiais internacionais e imcomp&#xE1;tiveis.</p>
<p>Outro importante org&#xE3;o na padroniza&#xE7;&#xE3;o &#xE9; o <a href="http://www.ieee.org" target="_blank"><strong><em>Institute of Electrical and Eletronics Engineers</em> (IEEE)</strong></a>, al&#xE9;m de publicar diversos peri&#xF3;dicos e promover confer&#xEA;ncias, o IEEE mant&#xE9;m um grupo de padroniza&#xE7;&#xE3;o nas &#xE1;reas de engenharia e computa&#xE7;&#xE3;o. Os padr&#xF5;es 802.3 (Ethernet) e 802.11 (LANs sem fio) sa&#xED;ram dos grupos de discuss&#xE3;o do IEEE, e tiveram um impacto enorme.</p>
<p>Temos ainda o <a href="https://www.ietf.org" target="_blank"><strong><em>Internet Engineering Task Force</em> (IETF)</strong></a> que &#xE9; um grupo internacional aberto, composto de t&#xE9;cnicos, ag&#xEA;ncias, fabricantes, fornecedores, pesquisadores que buscam o desenvolvimento, promo&#xE7;&#xE3;o e ado&#xE7;&#xE3;o dos padr&#xF5;es para a Internet. Trabalham em conjunto com os outros org&#xE3;os de padroniza&#xE7;&#xE3;o tamb&#xE9;m, e apresenta suas recomenda&#xE7;&#xF5;es atrav&#xE9;s de <strong><em>Request For Comments</em> (RFCs)</strong>. Qualquer pessoa interessada em pode acessar os padr&#xF5;es. <a href="https://tools.ietf.org/html/rfc3160" target="_blank">O pr&#xF3;prio IETF &#xE9; descrito em uma RFC.</a>.</p>
<p>A <a href="www.internetsociety.org"><strong><em>Internet Society</em></strong></a> &#xE9; outra organiza&#xE7;&#xE3;o neste ecossistema, &#xE9; uma organiza&#xE7;&#xE3;o sem fins lucrativos que facilita e sustenta a evolu&#xE7;&#xE3;o t&#xE9;cnica da Internet e promove o desenvolvimento de novas aplica&#xE7;&#xF5;es do sistema. No mesmo passo, temos a <a href="http://www.acm.org" target="_blank"><strong><em>Association for Computing Machinery</em> (ACM)</strong></a> que tamb&#xE9;m &#xE9; um org&#xE3;o de classe, interessada no desenvolvimento e promo&#xE7;&#xE3;o de padr&#xF5;es e avan&#xE7;os para a Internet.</p>
<p>Podemos dizer que os org&#xE3;os de classe s&#xE3;o mais pr&#xE1;ticos e est&#xE3;o interessados nos aspectos t&#xE9;cnicos das tecnologias adotadas na Internet, enquanto que os org&#xE3;os de padroniza&#xE7;&#xE3;o possuem uma vis&#xE3;o mais mercadol&#xF3;gica.</p>
<hr>
<h2 id="refer&#xEA;ncias">Refer&#xEA;ncias</h2>
<p>[1] Kalinka Castelo Branco, M&#xE1;rcio Teixeira, Paulo Gurgel. <strong>Redes de computadores : da teoria &#xE0; pr&#xE1;tica com Netkit</strong>. ISBN 9788535280494. Elsevier Brasil, 2014.</p>
<p>[2] Tanenbaum, Andrew S. <strong>Redes de Computadores</strong>. ISBN 8635211853. Elsevier Brasil, 2003.</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="introducao.html" class="navigation navigation-prev " aria-label="Previous page: Introdução">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="fisica.html" class="navigation navigation-next " aria-label="Next page: Camada física">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Conceitos básicos","level":"1.5","depth":1,"next":{"title":"Camada física","level":"1.6","depth":1,"path":"fisica.md","ref":"fisica.md","articles":[]},"previous":{"title":"Introdução","level":"1.4","depth":1,"path":"introducao.md","ref":"introducao.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["mathjax","youtube","alerts"],"pluginsConfig":{"youtube":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"alerts":{},"mathjax":{"forceSVG":false,"version":"2.6-latest"},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"conceitos.md","mtime":"2017-03-31T19:35:32.000Z","type":"markdown"},"gitbook":{"version":"3.2.2","time":"2017-04-05T03:51:23.252Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="https://cdn.mathjax.org/mathjax/2.6-latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-alerts/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

